DELETE FROM user_roles;
DELETE FROM tasks;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO tasks (date_time, text, name, user_id)
VALUES ('2020-01-30 10:00:00', 'География наука всей земли', 'География', 100000),
       ('2020-01-30 13:00:00', 'Трансмагестрпаыващ', 'Транс', 100000),
       ('2020-01-30 20:00:00', 'Мир полон загадок', 'Мир', 100000),
       ('2020-01-31 0:00:00', 'Еда на граничное значение', 'Еда', 100000),
       ('2020-01-31 10:00:00', 'Земля - большой шар', 'Земля', 100000),
       ('2020-01-31 13:00:00', 'Китай одна из самых густонаселенных стран', 'Китай', 100000),
       ('2020-01-31 20:00:00', 'Физика была заложена Эйнштейном', 'Физика', 100000),
       ('2020-01-31 14:00:00', 'Администратор любит поесть в 10', 'Администратор', 100001),
       ('2020-01-31 21:00:00', 'Победа на турнире стоила ему ног', 'Победа', 100001);